import { Paragraph, Picture } from "../../../components/atoms"
import { cirroCumulusCumuliformis, cirroCumulusUndulatus, cirroStratusFibr, cirroStratusFibratus, cirrusFibratus, cirrusIntortus, cirrusIntortusNebulosus, cirrusSpissatus, cirrusTraktus, cirrusUncinus, cirrusVertebratus } from "../../../constants/images"

export const CirrusFibratus = () => {
    return (
        <>
            <Picture source={cirrusFibratus} />
            <Paragraph>
                Перистые волокнистые - Cirrus fibratus (Ci fib) и высоко кучевые облака - Altocumulus (+Ac). Облака Ci fib - длинное белые иногда почти прямолинейные нити, которые могут располагаться то почти параллельно, то причудливо перепутанным клубком. Являются наиболее общей формой облаков верхнего яруса. Обычно состоят из кристаллов льда, которые возникают из переохлажденных капелек воды. Отличаются большей протяженностью и тем, что не заполняют все небо, а главное, обладают характерной прерывистой структурой. Чаще всего перистые облака наблюдаются при хорошей погоде и наличии восходящего потока воздуха при наступлении теплого фронта. Высота основания в умеренных широтах составляет 7-10 км, в тропиках они достигают 17-18 км. В арктических широтах облака при низких температурах могут распространяться до поверхности земли. Толщина слоя облаков может колебаться в широких пределах, от сотен метров до нескольких километров.
            </Paragraph>
            <Paragraph>
                Перистые облака обычно прозрачны, сквозь них просвечивает солнце, луна и яркие звезды, а иногда и голубое небо. Днем они не уменьшают освещенности, а наземные предметы отбрасывают заметные тени. Осадки- мелкие ледяные кристаллы, из которых состоят перистые облака, могут медленно падать, но почти всегда испаряются на больших высотах, не достигая земли и образуют только полосы падения. В редких случаях при очень низких температурах ледяные кристаллы возникают и в нижнем слое атмосферы, но при выпадении измеренного количества осадков не дают ( на станциях отмечаются только следы осадков).
            </Paragraph>
            <Paragraph>
                Образование перистых облаков происходит за счет охлаждения воздуха при восходящем движении в средней тропосфере в зоне атмосферных фронтов. В охлаждающемся воздухе происходит сублимация водяного пара и образование ледяных кристаллов. Мелкие ледяные кристаллы падают весьма медленно и восходящими движениями воздуха могут переноситься на более высокие уровни.
            </Paragraph>
            <Paragraph>
                Вечером, после захода солнца, Ci еще долго остаются освещенными, принимая серебристую, затем золотистую или красноватую окраску. Затем Ci постепенно сереют, при этом кажутся более плотными. Утром, перед восходом солнца, они первыми окрашиваются зарей.
            </Paragraph>
        </>
    )
}

export const CirroStratusFibratus = () => {
    return (
        <>
            <Picture source={cirroStratusFibratus} />
            <Paragraph>
                Перисто-слоистые волнистые - Cirrostratus fibratus (Cs fib) - белая пелена со слабым волнистым строением. Главной особенностью облаков является их расположение в виде параллельных, кажущихся сходящимися гряд. Облачность, как правило, закрывает все небо. Высота основания в средних широтах около 6-8 км, толщина слоя от 100 метров до нескольких километров. Часто наблюдается яркое гало вокруг солнца и луны. Сквозь них просвечивается голубое небо, а ночью -яркие звезды. Иногда Cs настолько тонкие и однородные, что обнаружить их можно только по наличию гало. Осадки из Cs не достигают земли, только при очень низких температурах дают слабый снег или ледяные иглы. Образуются вследствие адиабатического охлаждения воздуха при его восходящем движении в верхней тропосфере в зонах атмосферных фронтов.
            </Paragraph>
            <Paragraph>
                Появление облачности Cs fib может предвещать изменение погоды, в средних широтах - дожди.
            </Paragraph>
        </>
    )
}

export const CirrusVertebratus = () => {
    return (
        <>
            <Picture source={cirrusVertebratus} />
            <Paragraph>
                Перистые хребтовидные Cirrus vertebratus (Ci vert). Высоко расположенные тонкие облака более уплотнена средняя часть, от которой в обе стороны расходятся нити. Внешний вид напоминает скелет рыбы. Обычно состоят из кристаллов льда, которые возникают из переохлажденных капелек воды. Отличаются большей протяженностью и тем, что не заполняют все небо, а главное, обладают характерной прерывистой структурой. Чаще всего Ci vert наблюдаются при хорошей погоде и наличии восходящего потока воздуха и турбулентности в верхней тропосфере. Высота основания в умеренных широтах составляет 7-10 км, в тропиках они достигают 17-18 км. Толщина слоя облаков может колебаться в широких пределах, от сотен метров до нескольких километров.             </Paragraph>
            <Paragraph>
                Ci vert прозрачны, сквозь них просвечивает солнце, луна и яркие звезды. Днем они не уменьшают освещенности, а наземные предметы отбрасывают заметные тени. Осадки- мелкие ледяные кристаллы, из которых состоят перистые облака, медленно падают, но восходящими движениями воздуха могут переноситься и на более высокие уровни.             </Paragraph>
        </>
    )
}

export const CirrusSpissatus = () => {
    return (
        <>
            <Picture source={cirrusSpissatus} />
            <Paragraph>
                Перистые плотные - Cirrus spissatus (Ci sp) имеют многочисленные белые уплотнения неправильной формы. В отличие от обычных перистых облаков, волокнистое строение выражено меньше, бывают плотными и застилают солнце.
            </Paragraph>
            <Paragraph>
                Обычно состоят из кристаллов льда, которые возникают из переохлажденных капелек воды. Отличаются большей протяженностью и тем, что не заполняют все небо, а главное, обладают характерной прерывистой структурой. Высота основания в умеренных широтах составляет 7-10 км, в тропиках они достигают 17-18 км. Толщина слоя облаков может колебаться в широких пределах, от сотен метров до нескольких километров.
            </Paragraph>
            <Paragraph>
                Ci sp обычно прозрачны, сквозь них просвечивает солнце, луна и яркие звезды, а иногда и голубое небо. Днем они не уменьшают освещенности, а наземные предметы отбрасывают заметные тени. Около солнца и луны в этих облаках часто наблюдаются круги (гало) радиусом 22 и 46 градусов или части этих кругов.
            </Paragraph>
            <Paragraph>
                Осадки- мелкие ледяные кристаллы, из которых состоят перистые облака, могут медленно падать, но почти всегда испаряются на больших высотах. Образование (Ci sp) происходит за счет охлаждения воздуха при восходящем движении в средней тропосфере в зоне атмосферных фронтов. В охлаждающемся воздухе происходит сублимация водяного пара и образование ледяных кристаллов. Мелкие ледяные кристаллы падают весьма медленно и восходящими движениями воздуха могут переноситься на более высокие уровни. Вечером, после захода солнца, (Ci sp) еще долго остаются освещенными, принимая серебристую, затем золотистую или красноватую окраску.
            </Paragraph>
        </>
    )
}

export const CirroStratusFibr = () => {
    return (
        <>
            <Picture source={cirroStratusFibr} />
            <Paragraph>
                Перисто-слоистые волокнистые - Cirrostratus fibratus (Cs fibr) (Нет, не опечатка. Такое название. Просто смиритесь) тонкая пелена имеющая в основании волнистый вид, частично закрывающий небо.
            </Paragraph>
            <Paragraph>
                Осадки из Cs не достигают земли, только при очень низких температурах дают слабый снег или ледяные иглы. Образуются вследствие адиабатического охлаждения воздуха при его восходящем движении в верхней тропосфере в зонах атмосферных фронтов.
            </Paragraph>
        </>
    )
}

export const CirrusIntortus = () => {
    return (
        <>
            <Picture source={cirrusIntortus} />
            <Paragraph>
                Перистые перепутанные - Cirrus intortus (Ci int) расположены над грядой высоко-кучевых облаков Ac. Волокна перистых облаков загнуты беспорядочно, местами зигзагообразно, причудливо запутаны. Состоят из кристаллов льда, которые возникают из переохлажденных капелек воды. Отличаются большей протяженностью и тем, что не заполняют все небо. Наблюдаются при хорошей погоде и наличии восходящего потока воздуха при наступлении теплого фронта. Высота основания в умеренных широтах составляет 7-10 км, в тропиках они достигают 17-18 км. Толщина слоя облаков может колебаться в широких пределах, от сотен метров до нескольких километров.             </Paragraph>
            <Paragraph>
                Ci int обычно прозрачны, днем они не уменьшают освещенности. Осадки- мелкие ледяные кристаллы, из которых состоят перистые облака, могут медленно падать, но почти всегда испаряются на больших высотах, не достигая земли и образуют только полосы падения. В редких случаях при очень низких температурах ледяные кристаллы возникают и в нижнем слое атмосферы, но при выпадении измеренного количества осадков не дают ( на станциях отмечаются только следы осадков). Образование облаков происходит за счет охлаждения воздуха при восходящем движении в средней тропосфере в зоне атмосферных фронтов. В охлаждающемся воздухе происходит сублимация водяного пара и образование ледяных кристаллов.            </Paragraph>
        </>
    )
}

export const CirroStratusNebulosus = () => {
    return (
        <>
            <Picture source={cirrusIntortusNebulosus} />
            <Paragraph>
                Перисто-слоистые туманообразные - Cirrostratus nebulosus (Cs neb). Однородная или голубоватая пелена, чаще доволно плотная. Обычно состоят из кристаллов льда, которые возникают из переохлажденных капелек воды. Отличаются большей протяженностью. Высота основания в умеренных широтах составляет 7-10 км, в тропиках они достигают 17-18 км. Толщина слоя облаков может колебаться в широких пределах, от сотен метров до нескольких километров.
            </Paragraph>
            <Paragraph>
                Cs neb днем не уменьшают освещенности, а наземные предметы отбрасывают заметные тени. Около солнца и луны в этих облаках часто наблюдаются круги ( гало) радиусом 22 и 46 градусов или части этих кругов.
            </Paragraph>
            <Paragraph>
                Облака образуются вследствие адиабатического охлаждения воздуха при его восходящем движении в верхней тропосфере в зонах атмосферных фронтов.
            </Paragraph>
        </>
    )
}

export const CirrusUncinus = () => {
    return (
        <>
            <Picture source={cirrusUncinus} />
            <Paragraph>
                Перистые когтевидные - Cirrus uncinus (Ci un). Это относительно небольшие параллельные нити облаков с изгибом в форме запятой на конце. Обычно состоят из кристаллов льда, которые возникают из переохлажденных капелек воды. Отличаются большей протяженностью и тем, что не заполняют все небо. Чаще всего облака наблюдаются при наличии восходящего потока воздуха при наступлении теплого фронта. Ci un являются предвестниками перемен в погоде. Высота основания в умеренных широтах составляет 7-10 км, в тропиках они достигают 17-18 км. Облака прозрачны, сквозь них просвечивает солнце, луна и яркие звезды, а иногда и голубое небо. Днем они не уменьшают освещенности.             </Paragraph>
            <Paragraph>
                Осадки их этих облаков не выпадают. Образование перистых облаков происходит за счет охлаждения воздуха при восходящем движении в средней тропосфере в зоне атмосферных фронтов. В охлаждающемся воздухе происходит сублимация водяного пара и образование ледяных кристаллов. Мелкие ледяные кристаллы падают весьма медленно и восходящими движениями воздуха могут переноситься на более высокие уровни.             </Paragraph>
            <Paragraph>
                Вечером, после захода солнца, Ci un еще долго остаются освещенными, принимая серебристую, затем золотистую или красноватую окраску. Утром, перед восходом солнца, они первыми окрашиваются солнцем.            </Paragraph>
        </>
    )
}

export const CirroCumulusCumuliformis = () => {
    return (
        <>
            <Picture source={cirroCumulusCumuliformis} />
            <Paragraph>
                Перисто-кучевые кучевообразные Cirrocumulus cumuliformis (Cс cuf) - мелкие башенки или хлопья, растущие по вертикали. Внешний вид- белые тонкие облака, состоящие из очень мелких волн, хлопьев или ряби ( без серых оттенков), частично с волокнистым строением или непосредственно переходящие в покров Ci или Cs. Чаще всего наблюдаются в небольших количествах. Высота основания в умеренных широтах колеблется в пределах 6-8 км. Толщина слоя не превышает 200-400 метров. Облака Cc cuf прозрачные, закрывая солнце, они почти не уменьшают освещенности. Голубое небо придает им голубоватый оттенок.
                Осадки их этих облаков не выпадают. Образование перистых облаков происходит за счет охлаждения воздуха при восходящем движении в средней тропосфере в зоне атмосферных фронтов. В охлаждающемся воздухе происходит сублимация водяного пара и образование ледяных кристаллов. Мелкие ледяные кристаллы падают весьма медленно и восходящими движениями воздуха могут переноситься на более высокие уровни.
            </Paragraph>
            <Paragraph>
                Солнце и луна хорошо просвечиваются, при этом иногда наблюдается гало, а так же радужная окраска облака и отдельных его участков (иризация). Осадки из облаков не выпадают.
            </Paragraph>
        </>
    )
}

export const CirroCumulusUndulatus = () => {
    return (
        <>
            <Picture source={cirroCumulusUndulatus} />
            <Paragraph>
                Перисто-кучевые волнистые Cirrocumulus undulatus (Cc und) тонкие облака, характеризующиеся наличием волн или мелкой ряби. Толщина слоя не превышает 200-400 метров. Волнистая структура наблюдается иногда лишь у отдельных скоплений облаков. Образуются при возникновении волновых и восходящих движений в верхней тропосфере. Часто могут наблюдаться перед холодным фронтом 2-го рода и перед верхним холодным фронтом. Осадки их Cc und не выпадают.
            </Paragraph>
        </>
    )
}

export const CirrusTraktus = () => {
    return (
        <>
            <Picture source={cirrusTraktus} />
            <Paragraph>
                Следы самолетов, чаще от реактивных самолетов, также известные как конденсационные следы - Cirrus traktus (Ci trac). Это - искусственные перистые облака, возникающие за самолетами вследствие конденсации водяного пара, вылетающего из двигателей. Сразу после прохождения самолета выглядят в виде прожилки в небе. В течение 20-30 минут превращаются в широкие полосы в виде лент или приобретают очертаний овечьей шкуры.
            </Paragraph>
            <Paragraph>
                Следы самолетов наблюдаются на больших высотах в условиях очень низких температур, при которых вода превращается в лед, не успевая испариться.            </Paragraph>
        </>
    )
}




