import { Paragraph, Picture } from "../../../components/atoms"
import { altoCumulus, altoCumulusFloccus, altoCumulusLenticularis, altoCumulusTranslucidus, altoStratusOpacus, altoStratusTranslucidus, cirrusFibratus } from "../../../constants/images"

export const AltoCumulusFloccus = () => {
    return (
        <>
            <Picture source={altoCumulusFloccus} />
            <Paragraph>
                Высоко - кучевые хлопьевидные - Altocumulus floccus (Ac fl) - представляют собой белые разорванные по краям хлопья облаков, сравнительно быстро меняющие свои очертания. Образуются на высоте 2-6 км за счет конвективного движения воздуха в слое выше 2 км. Осадки могут выпадать в виде отдельных капель или снежинок. В отличие от перисто-кучевых облаков они могут иметь затененные части, которые, как правило, состоят из водяных капелек.             </Paragraph>
            <Paragraph>
                Высококучевые облака обычно возникают в результате поднятия теплых воздушных масс, а также при наступлении холодного фронта, который вытесняет теплый воздух вверх. Поэтому наличие высококучевых облаков теплым и влажным летним утром часто предвещает о скором появлении грозовых облаков или перемене погоды.
            </Paragraph>
        </>
    )
}

export const AltoStratusTranlucidus = () => {
    return (
        <>
            <Picture source={altoStratusTranslucidus} />
            <Paragraph>
                Высоко-слоистые просвечивающие - Altostratus translucidus (As trans)
                Волнитсая структура облака заметна, солнечный круг солнца вполне различим. На земле иногда могут возникать вполне различимые тени. Отчетливо видны полосы, Пелена облаков, как правило, постепенно закрывает все небо. Высота основание в пределах 3-5 км, толщина слоя облаков Ac trans в среднем коло 1 км, изредка до 2 км. Осадки выпадают, но в южных и средних широтах летом редко достигают земли.
            </Paragraph>
        </>
    )
}

export const AltoCumulus = () => {
    return (
        <>
            <Picture source={altoCumulus} />
            <Paragraph>
                Высоко-кучевые облака Altocumulus (Ac) -типичная облачность для теплого сезона. Располагается, как правило, над склонами, обращенными к солнцу. Иногда достигают стадии мощных кучевых облаков.
            </Paragraph>
            <Paragraph>
                Высококучевые облака обычно возникают в результате поднятия теплых воздушных масс, а также при наступлении холодного фронта, который вытесняет теплый воздух вверх. Поэтому наличие высококучевых облаков теплым и влажным летним утром часто предвещает о скором появлении грозовых облаков или перемене погоды.
            </Paragraph>
        </>
    )
}

export const AltoCumulusLenticularis = () => {
    return (
        <>
            <Picture source={altoCumulusLenticularis} />
            <Paragraph>
                Высоко-кучевые чечевицеобразные - Altocumulus lenticularis (Aс lent) - отдельные довольно плотные облака чечевицеобразной или сигарообразной формы с гладкими очертаниями и волнистой каймой. Образуются на высоте 2-6 км. Осадки могут выпадать в виде отдельных капель или снежинок. В отличие от перисто-кучевых облаков они могут иметь затененные части, которые, как правило, состоят из водяных капелек.
            </Paragraph>
            <Paragraph>
                Возникают за счет волновых движений воздуха на высоко расположенных границах инверсий, в частности перед холодными фронтами или фронтами окклюзий.
            </Paragraph>
        </>
    )
}

export const AltoCumulusTranslucidus = () => {
    return (
        <>
            <Picture source={altoCumulusTranslucidus} />
            <Paragraph>
                Высоко-кучевые просвечивающие - Altocumulus translucidus (Ac trans). Обычно состоят из резко разграниченных элементов ( волн, пластин), характеризуются неоднородной плотностью Плотные участки серого цвета чередуются с тонкими, более освещенными частями прозрачно-белого цвета. В тонких частях через облака могут просвечивать небесные светила или голубое небо. Образуются на высоте 2-6 км. Осадки могут выпадать в виде отдельных капель или снежинок.             </Paragraph>
            <Paragraph>
                Ac trans обычно возникают в результате поднятия теплых воздушных масс, а также при наступлении холодного фронта, который вытесняет теплый воздух вверх. Поэтому наличие Ac trans теплым и влажным летним утром часто предвещает о скором появлении грозовых облаков или перемене погоды.            </Paragraph>
        </>
    )
}

export const AltoStratusOpacus = () => {
    return (
        <>
            <Picture source={altoStratusOpacus} />
            <Paragraph>
                Высоко-слоистые непросвечивающие - Altostratus opacus (As op)
                Преставляют собой однородный покров серого цвета, часто переменной плотности, что отмечается по степени их освещенности ( местами облака темнее, местами светлее). Через эти облака солнце и луна не просвечивают, но местоположение их можно определить по расплявчатому светлому пятну на облаках. Образуются на высоте 3-5 км в виде пелены светло-серого или синеватого цвета, в которой можно различить полосы или волокна. Они почти всегда сменяют перисто-слоистые.
            </Paragraph>
            <Paragraph>
                Чаще всего такие облака возникают в процессе опускания и уплотнения перисто-слоистого облака. Они состоят из мелких капелек воды, но вершина этих облаков может достигать верхнего яруса и состоять их кристаллов льда. В этом случае ледяные кристаллы, падая в основную массу облака, действуют как ядра конденсации и вызывают осадки. Но в средних и южных широтах осадки, как правило, не достигаю земли вследствие испарения. Зимой из этих облаков идет снег.
            </Paragraph>
            <Paragraph>
                As op , покрывают большие пространства, по мере понижения их основания уплотняются, под ними появляться мелкие темные клочья.
            </Paragraph>
        </>
    )
}




