import { Paragraph } from "../../../components/atoms"

export const Fog = () => {
    return (
        <>
            <Paragraph>
                <Paragraph bold>Туман</Paragraph> - взвешенные в воздухе у поверхности земли капли воды или кисталлы льда, ухудшающие видимость до 1 км и менее.
            </Paragraph>
            <Paragraph><Paragraph bold>Дымка</Paragraph> - взвешенные в воздухе у поверхности земли капли воды или кисталлы льда, ухудшающие видимость от 2 до 9 км.</Paragraph>
            <Paragraph>
                Туман образуется в результате конденсации водяного пара в непосредственной близости от земной поверхности. По своей физической природе туман подобен облаку. Часто одно явление переходит в другое. Например, когда туман приподнимается, то он преобразуется в низкие разорванно-слоистые облака. И, наоборот, облака, снижаясь до поверхности земли, воспринимаются как явление тумана.
            </Paragraph>
            <Paragraph>
                Образование тумана связано главным образом с охлаждением приземного слоя воздуха, поэтому в зависимости от того, как происходит процесс охлаждения воздуха, туманы делятся на три типа: радиационные, адвективные, фронтальные.
            </Paragraph>
            <Paragraph>
                <Paragraph bold>Радиационный туман</Paragraph> образуется вследствие выхолаживания поверхности земли и прилегающего к ней слоя воздуха, при этом возникает инверсия температуры и при достаточной влажности воздуха образуется приземный туман, называемый радиационным. Наибольшая повторяемость радиационных туманов приходится на ночные часы, когда нет притока солнечной радиации, а земная поверхность и воздух теряют тепло в результате излучения. Радиационный туман отличается наибольшей плотностью у поверхности земли и видимость здесь часто ухудшается до нескольких десятков метров. С высотой плотность убывает, и с высоты полета земля сквозь него видна хорошо. С восходом солнца (началом прогрева) радиационный туман, как правило, рассеивается.
            </Paragraph>
            <Paragraph>
                <Paragraph bold>Адвективный туман</Paragraph> образуется при охлаждении относительно теплого и влажного воздуха, движущегося над более холодной подстилающей поверхностью. Зимой адвективный туман образуется, как правило, в воздушной массе, перемещающейся с океана на материк; летом — с материка на океан. Адвективный туман, в отличие от радиационного, возникает при более значительных скоростях ветра у поверхности земли, которые чаще всего бывают 4—8 м/сек, но он может образовываться и при более сильном ветре, достигающем 12— 15 м/сек. Особенностью адвективного тумана является также увеличение плотности с высотой. При этом видимость у поверхности земли может быть вполне удовлетворительной, но стоит подняться на несколько десятков метров (30—50 м), как горизонтальная видимость совершенно исчезает.
            </Paragraph>
            <Paragraph>
                Адвективный туман может образовываться в любую часть суток и сохраняться в течение длительного времени.
            </Paragraph>
            <Paragraph>
                <Paragraph bold>Фронтальные туманы</Paragraph>  — туманы, возникающие на атмосферных фронтах. Они бывают трех типов: пред- фронтальные, фронтальные и зафронтальные.
            </Paragraph>
            <Paragraph>
                Наиболее благоприятные условия для образования предфронтального тумана, когда температура выпадающего дождя значительно выше температуры холодного воздуха, располагающегося вблизи поверхности земли.
            </Paragraph>
            <Paragraph>
                Фронтальный туман возникает непосредственно при прохождении фронта. Такой туман представляет собой фронтальную облачную систему, распространяющуюся до поверхности земли, особенно часто наблюдается при прохождении фронтов над возвышенностями.
            </Paragraph>
            <Paragraph>
                Зафронтальный туман образуется непосредственно после прохождения теплого фронта или теплой окклюзии. Образование зафронтального тумана мало чем отличается от условий образования адвективного тумана.
            </Paragraph>
            <Paragraph bold>Кроме указанных выше, основных, наиболее часто встречающихся, видов туманов, наблюдаются и другие, как-то:
            </Paragraph>
            <Paragraph>
                адвективно-радиационные;
            </Paragraph>
            <Paragraph>
                туманы склонов;
            </Paragraph>
            <Paragraph>
                туманы испарений;
            </Paragraph>
            <Paragraph>
                морозные или ледяные туманы.
            </Paragraph>
        </>
    )
}

export const Blizzard = () => {
    return (
        <>
            <Paragraph><Paragraph bold>Метель</Paragraph> — перенос снега над поверхностью земли ветром достаточной силы. Различают три вида метели: поземок, низовая метель и общая метель.</Paragraph>
            <Paragraph><Paragraph bold>Позёмок</Paragraph> — перенос сухого снега ветром непосредственно над поверхностью снежного покрова. Поземок возникает при скорости ветра 4—6 м/сек, при этом снег поднимается до высоты в несколько десятков сантиметров.</Paragraph>
            <Paragraph><Paragraph bold>Низовая метель</Paragraph> — явление, схожее с поземком, стой лишь разницей, что она бывает при более сильном ветре. При низовой метели снег поднимается до высоты в несколько метров.</Paragraph>
            <Paragraph>Как поземок, так и низовая метель ухудшают видимость в самых нижних слоях атмосферы.</Paragraph>
            <Paragraph><Paragraph bold>Общая метель</Paragraph> характеризуется сильным ветром, поднимающим снег с земной поверхности, и выпадением снега из облаков.</Paragraph>
        </>
    )
}

export const DustStorm = () => {
    return (
        <>
            <Paragraph><Paragraph bold>Пыльная или песчаная буря</Paragraph> — явление аналогичное низовой метели, но с той лишь разницей, что пыльная буря бывает в южных степях и пустынях преимущественно летом, когда сильным ветром с поверхности земли поднимаются частицы песка или пыли, которые, замутняя атмосферу, резко ухудшают видимость.</Paragraph>
            <Paragraph>Вертикальная мощность пыльных бурь может быть самой различной— от нескольких десятков сантиметров (пыльные и песчаные поземки) до нескольких десятков и даже сотен метров.</Paragraph>
        </>
    )
}

export const Thunderstorm = () => {
    return (
        <>
            <Paragraph><Paragraph bold>Гроза</Paragraph> — атмосферное явление, при котором наблюдаются многократные электрические разряды (молнии) между облаками или между облаками и землей, сопровождаемые звуковым явлением — громом. Обычно при грозе наблюдаются обильные осадки в виде дождя, града и в очень редких случаях в виде снега.</Paragraph>
            <Paragraph>Иногда отмечаются грозы и без осадков; их называют <Paragraph bold>сухими</Paragraph> грозами.</Paragraph>
            <Paragraph><Paragraph bold>Грозы на холодных фронтах</Paragraph> — наиболее сильные. Они возникают вследствие мощного подъема теплого воздуха по клину холодного воздуха. В результате в передней части холодного фронта в теплое время года образуются мощные кучево-дождевые (грозовые) облака с ливнями, нередко с градом и со шквалами, достигающими ураганной силы.</Paragraph>
            <Paragraph>Грозы на холодном фронте усиливаются во вторую половину дня и ослабевают во второй половине ночи и утром.</Paragraph>
            <Paragraph><Paragraph bold>Грозы на тёплом фронте</Paragraph> — сравнительно редкое явление. Они развиваются в теплом неустойчивом воздухе, восходящем по клину холодного воздуха. Кучево-дождевые облака здесь бывают скрыты слоистообразными облаками. Характерным для гроз на теплом фронте является то, что наиболее активными они бывают в вечерние и ночные часы.</Paragraph>
            <Paragraph>Опасность для самолета и экипажа представляют мощные восходящие и нисходящие потоки воздуха внутри кучево-дождевых облаков и в непосредственной близости к ним, а также возможный разряд молнии в самолет.</Paragraph>
        </>
    )
}

export const Hail = () => {
    return (
        <>
            <Paragraph><Paragraph bold>Град</Paragraph> — осадки, выпадающие в теплое время года из мощных кучево-дождевых облаков в виде частичек плотного льда различных, иногда очень крупных размеров. Град обычно бывает при грозе вместе с ливневым дождем.</Paragraph>
        </>
    )
}

export const Squall = () => {
    return (
        <>
            <Paragraph><Paragraph bold>Шквал</Paragraph> —  — внезапное и кратковременное усиление скорости ветра (более 15 м/сек), сопровождающееся изменением его направления. Шквалы возникают в передней части кучево-дождевых (грозовых) облаков. Их можно видеть, как темный, нависший, крутящийся вал — «шкваловый ворот», представляющий собой вихрь с горизонтальной осью.</Paragraph>
        </>
    )
}

export const Iceing = () => {
    return (
        <>
            <Paragraph>
                <Paragraph bold>Обледенение</Paragraph>  — отложение льда на обтекаемых частях самолета, силовых установках и внешних деталях его специального оборудования (антенны и т. д.) при полете в воздухе, содержащем переохлажденные капли воды.
            </Paragraph>
            <Paragraph>
                Наиболее интенсивное обледенение наблюдается в тех облаках и в той их части, где больше водность и крупнее капли. Практика показывает, что наиболее интенсивное обледенение бывает при температурах от 0 до —10° С и ниже. При очень низких температурах в облаках (-30 -40°) интенсивного обледенения не возникает.
            </Paragraph>
            <Paragraph>
                По интенсивности отложениия льда принято считать обледенение слабым, когда лед откладывается со скоростью от 0,01 до 0,5 мм/мин, средним — от 0,51 до 1,0 мм/мин и сильным при скорости отложения льда больше 1,0 мм/мин.
            </Paragraph>
            <Paragraph>
                Опасность обледенения связана с тем, что в результате отложения льда искажется форма профиля крыла и оперения, что приводит к ухудшению аэродинамических качеств самолета, к потере его устойчивости.
            </Paragraph>
        </>
    )
}