import { Paragraph, Picture } from "../../../components/atoms"
import { coldFrontOne, coldFrontTwo, occlusionFront, secondFront, warmFront } from "../../../constants/images"


export const WarmFront = () => {
    return (
        <>
            <Picture source={warmFront} />
            <Paragraph>
                Тёплый фронт - атмосферный фронт, перемещающийся в сторону более холодного воздуха (наблюдается адвекция тепла). За тёплым фронтом в данный регион приходит тёплая воздушная масса.
            </Paragraph>
            <Paragraph>
                На карте погоды тёплый фронт отмечается красным цветом или зачернёнными полукружками, направленными в сторону перемещения фронта. По мере приближения линии тёплого фронта начинает падать давление, уплотняются облака, выпадают обложные осадки. Зимой при прохождении фронта обычно появляются низкие слоистые облака. Температура и влажность воздуха медленно повышаются. При прохождении фронта температура и влажность обычно быстро возрастают, ветер усиливается. После прохождения фронта направление ветра меняется (ветер поворачивает по часовой стрелке), падение давления прекращается и начинается его слабый рост, облака рассеиваются, осадки прекращаются. Поле барических тенденций представлено следующим образом: перед тёплым фронтом располагается замкнутая область падения давления, за фронтом - либо рост давления, либо относительный рост (падение, но меньшее, чем перед фронтом).
            </Paragraph>
            <Paragraph>
                В случае тёплого фронта тёплый воздух, перемещаясь в сторону холодного, натекает на клин холодного воздуха и совершает восходящее скольжение вдоль этого клина и динамически охлаждается. На некоторой высоте, определяемой начальным состоянием восходящего воздуха, достигается насыщение - это уровень конденсации. Выше этого уровня в восходящем воздухе происходит облакообразование. Адиабатическое охлаждение тёплого воздуха, скользящего вдоль клина холодного, усиливается развитием восходящих движений от нестационарности при динамическом падении давления и от сходимости ветра в нижнем слое атмосферы. Охлаждение тёплого воздуха при восходящем скольжении по поверхности фронта приводит к образованию характерной системы слоистообразных облаков (облаков восходящего скольжения): перисто-слоистые - высоко-слоистые -слоисто-дождевые (Cs-As-Ns).
            </Paragraph>
            <Paragraph>
                При приближении к пункту тёплого фронта с хорошо развитой облачностью сначала появляются перистые облака в виде параллельных полос с когтевидными образованиями в передней части (предвестники тёплого фронта), вытянутые в направлении воздушных течений на их уровне (Ci uncinus). Первые перистые облака наблюдаются на расстоянии многих сотен километров от линии фронта у поверхности Земли (около 800-900 км). Перистые облака переходят затем в перисто-слоистые облака (Cirrostratus). Для этих облаков характерны явления гало. Облака верхнего яруса - перисто-слоистые и перистые (Ci и Cs) состоят из ледяных кристаллов, и осадки из них не выпадают. Чаще всего облака Ci-Cs представляют собой самостоятельный слой, верхняя граница которого совпадает с осью струйного течения, то есть близка к тропопаузе.
            </Paragraph>
            <Paragraph>
                Затем облака становятся всё плотнее: высоко-слоистые облака (Altostratus) постепенно переходят в слоисто-дождевые (Nimbostratus), начинают выпадать обложные осадки, которые ослабевают или совсем прекращаются после прохождения линии фронта. По мере приближения к линии фронта высота основания Ns снижается. Минимальное её значение определяется высотой уровня конденсации в восходящем тёплом воздухе. Высокослоистые (As) являются коллоидальными и состоят из смеси мельчайших капелек и снежинок. Их вертикальная мощность довольно значительна: начинаясь на высоте 3-5 км, эти облака простираются до высот порядка 4-6 км, то есть имеют 1-3 км в толщину. Выпадающие из этих облаков осадки летом, проходя сквозь тёплую часть атмосферы, испаряются и не всегда достигают поверхности Земли. Зимой осадки из As в виде снега почти всегда достигают поверхности Земли, а также стимулируют выпадение осадков из нижележащих St-Sc. В этом случае ширина зоны обложных осадков может достигать ширины 400 км и более. Ближе всего к поверхности Земли (на высоте нескольких сотен метров, а порой 100-150 м и даже ниже) находится нижняя граница слоисто-дождевых облаков (Ns), из которых выпадают обложные осадки в виде дождя или снега; под слоисто-дождевыми облаками нередко развиваются разорванно-дождевые (St fr).
            </Paragraph>
            <Paragraph>
                Облака Ns простираются до высот 3…7 км, то есть имеют весьма значительную вертикальную мощность. Облака также состоят из ледяных элементов и капель, причём, и капли и кристаллы особенно в нижней части облаков более крупные, чем в As. Нижнее основание системы облаков As-Ns в общих чертах совпадает с поверхностью фронта. Поскольку верхняя граница облаков As-Ns приблизительно горизонтальна, наибольшая их толщина наблюдается вблизи линии фронта. У центра циклона, где система облаков тёплого фронта имеет наибольшее развитие, ширина облачной зоны Ns и зоны обложных осадков в среднем - около 300 км. В целом облака As-Ns имеют ширину 500-600 км, ширина зоны облаков Ci-Cs - около 200-300 км. Если спроецировать данную систему на приземную карту, то вся она окажется перед линией тёплого фронта на расстоянии 700-900 км. В отдельных случаях зона облачности и осадков может быть значительно шире или уже, в зависимости от угла наклона фронтальной поверхности, высоты уровня конденсации, термических условий нижней тропосферы.
            </Paragraph>
            <Paragraph>
                В ночное время радиационное выхолаживание верхней границы облачной системы As-Ns и понижение температуры в облаках, а также усиление вертикального перемешивания при опускании охлаждённого воздуха внутрь облака способствует образованию ледяной фазы в облаках, росту облачных элементов и образованию осадков. По мере удаления от центра циклона восходящие движения воздуха ослабевают, осадки прекращаются. Фронтальные облака могут образовываться не только над наклонной поверхностью фронта, а в некоторых случаях - и по обе стороны от фронта. Это особенно характерно для начальной стадии циклона, когда восходящие движения захватывают зафронтальную область - тогда и осадки могут выпадать с обеих сторон фронта. Но за линией фронта фронтальная облачность обычно сильно расслоена и зафронтальные осадки чаще представлены в виде мороси или снежных зёрен.
            </Paragraph>
            <Paragraph>
                В случае очень пологого фронта система облаков может быть смещена вперед от линии фронта. В тёплое время года восходящие движения вблизи линии фронта приобретают характер конвективных, и на тёплых фронтах нередко развиваются кучево-дождевые облака и наблюдаются ливневые осадки и грозы (как днём, так и ночью).
            </Paragraph>
            <Paragraph>
                Летом в дневные часы в приземном слое за линией тёплого фронта при значительной облачности температура воздуха над сушей может быть ниже, чем перед фронтом. Это явление называется маскировкой тёплого фронта.
            </Paragraph>
            <Paragraph>
                Облачность старых тёплых фронтов также может быть расслоенной на всём протяжении фронта. Постепенно эти слои рассеиваются и осадки прекращаются. Порой тёплый фронт не сопровождается осадками (особенно летом). Так бывает при малом влагосодержании тёплого воздуха, когда уровень конденсации лежит на значительной высоте. При сухости воздуха и особенно в случае его заметной устойчивой стратификации восходящее скольжение тёплого воздуха не приводит к развитию мало-мальски мощной облачности - то есть облака вообще отсутствуют, либо наблюдается полоса облаков верхнего и среднего ярусов.
            </Paragraph>
        </>
    )
}

export const ColdFrontOne = () => {
    return (
        <>
            <Picture source={coldFrontOne} />
            <Paragraph>
                Холодный фронт - атмосферный фронт (поверхность, разделяющая тёплую и холодную воздушную массы), перемещающийся в сторону тёплого воздуха. Холодный воздух наступает и оттесняет тёплый воздух: наблюдается адвекция холода, за холодным фронтом в данный регион приходит холодная воздушная масса.
            </Paragraph>
            <Paragraph>
                На карте погоды холодный фронт отмечается синим цветом или зачернёнными треугольниками, направленными в сторону перемещения фронта. При переходе через линию холодного фронта ветер, как и в случае тёплого фронта, поворачивает вправо, но поворот более значительный и резкий - от юго-западного, южного (перед фронтом) к западному, северо-западному (за фронтом). При этом усиливается скорость ветра. Атмосферное давление перед фронтом меняется медленно. Оно может падать, но может и расти. С прохождением холодного фронта начинается быстрый рост давления. За холодным фронтом рост давления может достигать 3-5 гПа/3 ч., а иногда 6-8 гПа/3 ч. и даже более. Изменение барической тенденции (от падения к росту, от медленного роста к более сильному) свидетельствует о прохождении линии приземного фронта.
            </Paragraph>
            <Paragraph>
                В холодном фронте первого рода холодный воздух продвигается вперед в виде тупого клина и оттесняет теплый воздух вверх. Быстрый подъем теплого воздуха приводит к появлению непосредственно перед фронтом кучево-дождевых облаков, из которых выпадают ливневые осадки, часто сопровождающиеся грозами.
            </Paragraph>
            <Paragraph>
                В отличие от обособленных кучевых и ливневых облаков, образующихся днем внутри однородной холодной воздушной массы, перед линией холодного фронта кучево-дождевые облака движутся сплошным валом. За линией фронта теплый воздух поднимается вдоль фронтальной поверхности спокойно, и после прохождения линии фронта кучево-дождевые облака сменяются слоисто-дождевыми, из которых выпадают обложные осадки. Затем появляются высоко-слоистые и перисто-слоистые облака, осадки прекращаются, и, наконец, наступает прояснение. Таким образом, формы облаков при прохождении холодного фронта первого рода сменяются в обратном порядке по сравнению с теплым фронтом. Кроме того, при приближении теплого фронта первые его предвестники в виде перистых облаков появляются примерно за сутки до его прохождения, а при приближении холодного фронта первого рода характерные для него кучево-дождевые облака появляются непосредственно около линии фронта. Поэтому заблаговременный прогноз погоды по местным признакам, связанным с прохождением холодного фронта первого рода, труден.
            </Paragraph>
            <Paragraph>
                После прохождения фронта давление резко растет, а температура воздуха понижается. Ветер при прохождении фронта усиливается и становится порывистым, за фронтом его направление обычно меняется, и он поворачивает вправо, скорость ветра уменьшается.
            </Paragraph>
        </>
    )
}

export const ColdFrontTwo = () => {
    return (
        <>
            <Picture source={coldFrontTwo} />
            <Paragraph>
                Быстродвижущийся холодный фронт 2 рода является самым опасным их всех видов атмосферных фронтов. Вследствие большой скорости перемещения (40-50 км/час) холодный воздух с большой энергией вытесняет тёплый воздух вверх до больших высот. В летнее время в результате этой сильной динамической конвекции в тёплом воздухе образуются кучево-дождевые облака большой вертикальной мощности, иногда пробивая тропопаузу. В холодное время года мощность облаков бывает меньшей.
            </Paragraph>
            <Paragraph>
                Кучево-дождевые облака вытесняются вперед по направлению ветра на больших высотах, на 100-300км от линии фронта. Предвестником приближения такого фронт являются высококучевые облака чечевицеобразные (Ac), появляющиеся за 200км перед приземной линией фронта. У самой линии фронта кучево-дождевые облака сопровождаются шкваловыми вихрями с разрушительными скоростями ветра и грозами. Ширина облачной системы достигает нескольких десятков километров, нижняя граница находится обычно на высоте 300-400м, а в зоне осадков может опускаться до 100-200м.
            </Paragraph>
            <Paragraph>
                В облаках большую опасность представляют восходящие потоки силой до 30м/с и более и нисходящие до 15 м/с и более. Кроме того, в облаках могут быть грозы, сильные ливневые осадки, а в зоне отрицательных температур – интенсивное обледенение. Но ширина этой опасной зоны небольшая, примерно 50 км.
            </Paragraph>
            <Paragraph>
                У земли этот фронт сопровождается шквалами, ливнями, грозами, ширина зоны ливневых осадков – несколько десятков километров и наблюдается обычно впереди приземной линии фронта. Давление перед фронтом резко падает, за фронтом быстро растёт. Ветер после прохождения фронта резко меняет направление вправо и усиливается до 20-30 м/с. Температура за фронтом понижается на 10-12°С за 1 час.
            </Paragraph>
            <Paragraph>
                Наиболее ярко выражена погода на этом фронте летом во второй половине дня.
            </Paragraph>
            <Paragraph>
                Зимой при прохождении фронта отмечаются сильные снегопады, метели, ухудшающие видимость до нескольких десятков метров. Основные облака – кучево-дождевые (Cb) с верхней границей 4-5 км.
            </Paragraph>
            <Paragraph>
                Полёты на эшелоне проходят в простых метеоусловиях, а основное влияние их проявляется на низких эшелонах при взлёте, посадке и в наборе.
            </Paragraph>
        </>
    )
}

export const OcclusionFront = () => {
    return (
        <>
            <Picture source={occlusionFront} />
            <Paragraph>
                Фронт окклюзии - сложный фронт, возникающий в циклоне в результате смыкания холодного фронта с теплым. Различают два типа основных фронтов окклюзии: теплый и холодный.
            </Paragraph>
            <Paragraph>
                Теплый фронт окклюзии образуется в том случае, когда в тыловой части циклона распологается менее холодная воздушная масса, чам в передней его части (обычно наблюдается в холодное время года). На линии фронта образуется многослойная облачность, которая постепенно развивается в слоистообразную облачную систему, подобную теплому фронту.
            </Paragraph>
            <Paragraph>
                Холодный фронт окклюзии образуется в том случае, когда в тыловой части циклона распологается более холодная воздушная масса, чем в передней его части (обычно наблюдается в теплое время года). По мере продвижения фронт принимает характер обычного холодного фронта с хорошо развитой зоной фронтальных осадков, грозовой деятельностьтю и шквалами.
            </Paragraph>
            <Paragraph>
                Секклюзия - редко встречающийся процесс, когда окклюдирование начинается не у центра циклона, а на некотором удалении от него.

                Изолированный участок теплого сектора вблизи центра циклона сохраняется непродолжительное время. Разновидностью секклюзии является орографическая окклюзия, связанная с огибанием линией фронта горного препятствия, если непосредственно за горами образуется изолированная область теплого воздуха.
            </Paragraph>
        </>
    )
}

export const SecondFront = () => {
    return (
        <>
            <Picture source={secondFront} />
            <Paragraph>
                Вторичные атмосферные фронты - фронты, которые существуют только в нижних слоях атмосферы – у поверхности Земли или у Земли и не выше АТ850, а в поле температуры на высотах не обнаруживаются, относятся к вторичным (приземным, низким).
                Это, как правило, фронты внутри неоднородной воздушной массы, разделяющие её на две
                воздушные массы одного происхождения.
            </Paragraph>
            <Paragraph>
                Наиболее частый случай вторичного фронта – фронт внутри горизонтально неоднородной холодной воздушной массы (арктического или полярного воздуха), за которым
                вторгается более “свежая” и более холодная часть этой же воздушной массы. Вторичные
                фронты нередко наблюдаются в тылу циклона за основным фронтом. Вторичные фронты
                существуют не более 1-2 суток, не связаны с ВФЗ и обычно не выходят за пределы циклона, с которым они связаны.
            </Paragraph>
        </>
    )
}

export const HeightFront = () => {
    return (
        <>
            <Paragraph>
                Высотными называются фронты, отсутствующие у
                поверхности Земли, но выраженные на высотах. Они могут образоваться вследствие размывания фронта у поверхности Земли, но сохраняющегося на высотах. Фронты также могут самостоятельно образовываться на высотах, не достигая Земли. Когда зимой фронт
                перемещается над приземным слоем очень выхоложенного воздуха, то он становится замаскированным и не прослеживается в поле температуры у поверхности Земли. В качестве верхнего фронта можно рассматривать и ВФЗ, с которыми не связаны атмосферные
                фронты у Земли.
            </Paragraph>

        </>
    )
}